In [48]:
import pandas as pd

In [49]:
import numpy as np

In [50]:
stu=pd.DataFrame({
    "Id":[1,2,3],
    "Name":["A","B","c"]
})
stu

   Id Name
0   1    A
1   2    B
2   3    c

In [51]:
mark=pd.DataFrame({
    "Id":[1,2,3],
    "math":[95,70,80],
    "science":[70,80,85]
})
mark

   Id  math  science
0   1    95       70
1   2    70       80
2   3    80       85

In [52]:
pd.merge(stu,mark)

   Id Name  math  science
0   1    A    95       70
1   2    B    70       80
2   3    c    80       85

In [53]:
pd.concat((stu,mark),axis=1)

   Id Name  Id  math  science
0   1    A   1    95       70
1   2    B   2    70       80
2   3    c   3    80       85

In [54]:
data = {
    "Name": ["Luffy", "Zoro", "Nami", "Sanji", "Zoro", "Nami"],
    "Subject": ["Math", "Math", "Math", "Math", "Science", "Science"],
    "Score": [95, 88, 76, 85, 92, 81]
}

df = pd.DataFrame(data)
df

    Name  Subject  Score
0  Luffy     Math     95
1   Zoro     Math     88
2   Nami     Math     76
3  Sanji     Math     85
4   Zoro  Science     92
5   Nami  Science     81

In [55]:
df.groupby("Subject")["Score"].mean()

Subject
Math       86.0
Science    86.5
Name: Score, dtype: float64

In [56]:
(df.groupby("Name")["Score"].mean()).to_frame()

       Score
Name
Luffy   95.0
Nami    78.5
Sanji   85.0
Zoro    90.0

#### Group by Department and calculate average salary.

In [57]:
data =pd.DataFrame ({
    "Name": ["Luffy", "Zoro", "Nami", "Sanji", "Robin", "Franky"],
    "Department": ["IT", "IT", "HR", "HR", "Finance", "Finance"],
    "Salary": [60000, 65000, 50000, 52000, 70000, 72000]})
data

     Name Department  Salary
0   Luffy         IT   60000
1    Zoro         IT   65000
2    Nami         HR   50000
3   Sanji         HR   52000
4   Robin    Finance   70000
5  Franky    Finance   72000

In [58]:
print("average salary is : \n ",(data.groupby("Department")["Salary"].mean()).to_frame())

average salary is :
               Salary
Department
Finance     71000.0
HR          51000.0
IT          62500.0

#### From a sales DataFrame, find the department with the highest total sales."""

In [65]:
sales = pd.DataFrame({
    "Department": ["Electronics", "Clothing", "Electronics", "Clothing", "Furniture"],
    "Salesperson": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Total_Sales": [2000, 1500, 3000, 1200, 2500]
})
ind=[1,2,3,4,5]
sales.index=ind
sales

    Department Salesperson  Total_Sales
1  Electronics       Alice         2000
2     Clothing         Bob         1500
3  Electronics     Charlie         3000
4     Clothing       David         1200
5    Furniture         Eve         2500

In [71]:
max_sales_dept = dept_sales.idxmax()
max_sales_dept

'Electronics'

In [72]:
sales.nlargest(3,"Total_Sales")

    Department Salesperson  Total_Sales
3  Electronics     Charlie         3000
5    Furniture         Eve         2500
1  Electronics       Alice         2000

In [73]:
sales = pd.DataFrame({
    "Department": ["Electronics", "Clothing", "Electronics", "Clothing", "Furniture"],
    "Salesperson": ["Alice", "Bob", "Charlie", "David", "Eve"],
    "Total_Sales": [2000, 1500, 3000, 1200, 2500]
})
ind=[1,2,3,4,5]
sales.index=ind
sales
max_sales_dept = dept_sales.idxmax()
max_sales_dept

'Electronics'

In [74]:
sales.groupby("Department")["Total_Sales"].sum()

Department
Clothing       2700
Electronics    5000
Furniture      2500
Name: Total_Sales, dtype: int64

In [75]:
dept_sales.max()

5000